rails/app/controllers/api/journeys_controller.rb

SELECT "journeys".* FROM "journeys"
---
  def index
    if params.has_key?(:user_id)
      @journeys = Journey.where(user_id: params[:user_id])
      render json: @journeys, include: :locations
    else
      @journeys = Journey.all

SELECT  "journeys".* FROM "journeys"  WHERE "journeys"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "locations".* FROM "locations"  WHERE "locations"."journey_id" = $1  [["journey_id", 1]]
---
  def show
    render json: Journey.find(params[:id]), include: :locations