rails/app/controllers/api/users_controller.rb

SELECT  1 AS one FROM "users"  WHERE "users"."username" = 'locations' LIMIT 1
---
  def show
    if User.exists?(username: params[:id])