app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    if User.exists?(username: params[:username])
---
SELECT  1 AS one FROM "users"  WHERE "users"."username" = 'signin' LIMIT 1