rails/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'im@gmail.com' LIMIT 1
---
  def login
    byebug
    @user = User.find_by_email(params[:email].downcase)