rails/app/controllers/journeys_controller.rb

SELECT "journeys".* FROM "journeys"
---
  def index
    if params.has_key?(:user_id)
      @journeys = Journey.where(user_id: params[:user_id])
      render json: @journeys, include: :locations
    else
      @journeys = Journey.all